 <div class="row">
        <div class="col-lg-9">
            <h1>584.Find Customer Referee</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Given a table <code>customer</code> holding customers information and the referee.</p>

<pre>
+------+------+-----------+
| id   | name | referee_id|
+------+------+-----------+
|    1 | Will |      NULL |
|    2 | Jane |      NULL |
|    3 | Alex |         2 |
|    4 | Bill |      NULL |
|    5 | Zack |         1 |
|    6 | Mark |         2 |
+------+------+-----------+
</pre>

<p>Write a query to return the list of customers <b>NOT</b> referred by the person with id &#39;2&#39;.</p>

<p>For the sample data above, the result is:</p>

<pre>
+------+
| name |
+------+
| Will |
| Jane |
| Bill |
| Zack |
+------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("customer", engine)

   id  name  referee_id
0   1  Will         NaN
1   2  Jane         NaN
2   3  Alex         2.0
3   4  Bill         NaN
4   5  Zack         1.0
5   6  Mark         2.0

In [3]:
query = '''
SELECT c.name
FROM customer c
WHERE IFNULL(c.referee_id, 0) <> 2;
'''
pd.read_sql_query(query, engine)

   name
0  Will
1  Jane
2  Bill
3  Zack